#include <stdio.h>
#include <stdlib.h>
#include <limits.h>

// Функция для вывода числа в бинарном формате с тире каждые 4 бита
void bin(unsigned int num) {

	// Определяем количество битов для типа int
	int bits = sizeof(num) * CHAR_BIT; // 4 * 8 = 32
	for (int i = bits - 1; i >= 0; i--) {
		putchar((num & (1u << i)) ? '1' : '0');

		// Добавляем тире после каждых 4 бит, кроме последней группы
		if (i % 4 == 0 && i != 0) {
			putchar('-');
		}
	}
	printf("\n");
}

int main() {
	unsigned int x = 0b00000111;
	unsigned int y = 0b00001111;
	unsigned int mask = 0b00001000;

	// Побитовое И
	bin(x & y);  // 0000-0000-0000-0000-0000-0000-0000-0111

	//Проверка наличия бита
	bin(x & mask); // 0000-0000-0000-0000-0000-0000-0000-0000
	bin(y & mask); // 0000-0000-0000-0000-0000-0000-0000-1000

	unsigned int new_y = 0b00001111;
	// Сброс всех битов, кроме тех, что установлены в mask
	new_y &= mask; // составной оператор &=
	bin(new_y);//0000-0000-0000-0000-0000-0000-0000-1000

	x = 0b00000011;
	y = 0b00001100;
	// Побитовое ИЛИ 
	bin(x | y); // 0000-0000-0000-0000-0000-0000-0000-1111

	unsigned int new_x = 0b00000011;
	new_x |= 0b00001100;// составной оператор |=
	bin(new_x); // 0000-0000-0000-0000-0000-0000-0000-1111

	// инверсия битов (ксор с единичкой инвертирует бит)
	x = 0b01010011;
	bin(x ^ 0b10101100); //0000-0000-0000-0000-0000-0000-1111-1111

	// инверсия битов (ксор с единичкой инвертирует бит)
	x = 0b11110000;
	x ^= 0b00001111; // составной оператор ^=
	bin(x); // 0000-0000-0000-0000-0000-0000-1111-1111

	// Инверсия всех битов (Битовая операция НЕ)
	x = 0b11110000;
	bin(~x); // 1111-1111-1111-1111-1111-1111-0000-1111

	//Битовый сдвиг (bit shift)
	x = 0b00000001;
	// сдвиг влево на 3 бита 
	bin(x << 3); // 0000-0000-0000-0000-0000-0000-0000-1000

	y = 0b00001000;
	// сдвиг вправо на 2 бита
	bin(y >> 2); // 0000-0000-0000-0000-0000-0000-0000-0010

	//составные операторы >>= и <<=:
	x = 0b00000001;
	x <<= 3; // сдвиг влево на 3 бита
	bin(x); // 0000-0000-0000-0000-0000-0000-0000-1000
	x >>= 2; // сдвиг вправо на 2 бита
	bin(x); // 0000-0000-0000-0000-0000-0000-0000-0010



	return 0; 
}